<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2016 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------
// $Id$

return [
    'url_route_on' => true,
    'trace' => [
        'type' => 'html', // 支持 socket trace file
    ],
    //各模块公用配置
    'extra_config_list' => ['database', 'route', 'validate'],

    'app_debug' => true,
    'default_filter' => ['strip_tags', 'htmlspecialchars'],

    // +----------------------------------------------------------------------
    // | 缓存设置
    // +----------------------------------------------------------------------
    'cache' => [
        // 驱动方式
        'type' => 'file',
        // 缓存保存目录
        'path' => CACHE_PATH,
        // 缓存前缀
        'prefix' => '',
        // 缓存有效期 0表示永久缓存
        'expire' => 0,
        'host' => '127.0.0.1',
        'port' => 11211,
    ],

    //加密串
    'salt' => 'wZPb~yxvA!ir38&Z',

    //备份数据地址
    'back_path' => APP_PATH .'../back/',

    //默认显示的用户分组
    'user_group' => [
        '1' => '我的好友',

    ],
    // +----------------------------------------------------------------------
    // | 会话设置
    // +----------------------------------------------------------------------
    'session'                => [
        'id'             => '',
        // SESSION_ID的提交变量,解决flash上传跨域
        'var_session_id' => '',
        // 是否自动开启 SESSION
        'auto_start'     => true,
        'expire'         => 604800,
    ],
    // +----------------------------------------------------------------------
    // | 日志设置
    // +----------------------------------------------------------------------
    'log'                    => [
        // 日志记录方式，内置 file socket 支持扩展
        'type'        => 'File',
        // 日志保存目录
        'path'        => LOG_PATH,
        // 日志记录级别 log,error,info,sql,notice,alert,debug
        'level'       => [],
        // error和sql日志单独记录
        'apart_level' => ['error', 'info', 'sql'],
    ],
    //IP
    'view_replace_str'=>[
        '__ip__' => '114.55.124.80'
    ],
    //短信配置
    'sms'                    => [
        'secret'    => 'b57b5d3e5d8e658b37b7f51bdacf0b2e',
        'template'  => [
            'valid' => '您的短信验证码是: {code} ,如非本人操作,请忽略【乐闲清来】'
        ]
    ],
];